src/Documents/РазборКоробки/РазборКоробки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РазборКоробки</name>
  <registerRecords>InformationRegister.ПокупкиОтдельнымМестом</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыВПосылках</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <registerRecords>InformationRegister.ОчередьРазбора</registerRecords>
  <registerRecords>InformationRegister.Обмен100сп</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>AccumulationRegister.НеВыгруженноНаСайт</registerRecords>
  <registerRecords>InformationRegister.НегабаритЗначения</registerRecords>
  <registerRecords>InformationRegister.Обмен100спСообщения</registerRecords>
  <registerRecords>AccumulationRegister.Приход</registerRecords>
  <registerRecords>AccumulationRegister.КПолучению</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКоробка</name>
    <type>
      <types>CatalogRef.Коробки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СвояТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДелаемГрупповойСтикер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсеКоробки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсеОрги</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитываемНеСоответствиеВКоробках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Супергруппа</name>
    <type>
      <types>CatalogRef.Мегаордера</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Предупреждение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.Организаторы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Коробка</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтдельнымМестом</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Коробки</name>
    <attributes>
      <name>Коробка</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКРазбору</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Посылки</name>
    <attributes>
      <name>Посылка</name>
      <type>
        <types>CatalogRef.Посылки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коробка</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтдельнымМестом</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>Загружено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыНаТранзит</name>
    <attributes>
      <name>Коробка</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтдельнымМестом</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/УчастникиВГруппах/УчастникиВГруппах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчастникиВГруппах</name>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.ГруппыУчастников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/КПолучению/КПолучению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КПолучению</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Покупка</name>
    <type>
      <types>DefinedType.ТипыЗаказа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументВыдачи</name>
    <type>
      <types>DocumentRef.ВыдачаТранзита</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ТипыОбменов100сп/ТипыОбменов100сп.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбменов100сп</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВозврата</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Карты</name>
  </enumValues>
  <enumValues>
    <name>Транзит</name>
  </enumValues>
  <enumValues>
    <name>СуперГруппа</name>
  </enumValues>
  <enumValues>
    <name>СуперГруппаРегистрация</name>
  </enumValues>
  <enumValues>
    <name>СуперГруппаКолено</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаПосылок</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеПристроя</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаЯндекс</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыПриходов/ТипыПриходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПриходов</name>
  <enumValues>
    <name>НаСклад</name>
  </enumValues>
  <enumValues>
    <name>НаТранзит</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтУчастника</name>
  </enumValues>
  <enumValues>
    <name>ПристройНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ПристройНаТранзит</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Мегаордера/Мегаордера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Мегаордера</name>
  <predefined>
    <items>
      <name>нулевой</name>
    </items>
  </predefined>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупка</name>
    <type>
      <types>CatalogRef.Покупки</types>
      <types>DocumentRef.ВыдачаТранзита</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.Посылки</types>
      <types>CatalogRef.Пристрой</types>
      <types>CatalogRef.Коробки</types>
      <types>CatalogRef.СобранныеЗаказы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктВыдачи</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяТочкаПриема</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>типМегаордера</name>
    <type>
      <types>EnumRef.типМегаордера</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коробка</name>
    <type>
      <types>CatalogRef.Коробки</types>
    </type>
  </attributes>
  <attributes>
    <name>Посылка</name>
    <type>
      <types>CatalogRef.Посылки</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ВыдачаТранзита</types>
      <types>DocumentRef.УпаковатьЗаказы</types>
    </type>
  </attributes>
  <attributes>
    <name>СобранныйЗаказ</name>
    <type>
      <types>CatalogRef.СобранныеЗаказы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Маршрут</name>
    <attributes>
      <name>ТранспортнаяКомпания</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрэкНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставкиПлан</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставкиФакт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DefinedType.ТипыЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/РазборКоробки/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	СтоСП_Печать.ДобавитьКомандыПечатиПоступлений(КомандыПечати);
КонецПроцедуры


#КонецОбласти

#Область Сверка

Функция  	ПолучитьСверкуДокумента(Параметры) Экспорт 
	Результат	= Новый ТабличныйДокумент;
	
	Если ЗначениеЗаполнено(Параметры.Документ_Объект.Супергруппа) Тогда
		ТЗ_Сверка 	= РасщитатьСверкуСупергруппы(Параметры);
		ТЗ_Сверка_2 = РасщитатьСверкуКоробок(Параметры, истина);
		Для каждого Элем из ТЗ_Сверка_2 Цикл
			строкаСверки = ТЗ_Сверка.Добавить();
			ЗаполнитьЗначенияСвойств(строкаСверки, Элем);
		КонецЦикла;
	Иначе
		ТЗ_Сверка	 = РасщитатьСверкуКоробок(Параметры, истина);
	КонецЕсли;	
	
	КоличествоПроблемныхПозиций = 0;
	
	Для каждого элем из ТЗ_Сверка Цикл
		Если элем.Разница = 0 Тогда Продолжить; КонецЕсли;
		КоличествоПроблемныхПозиций = КоличествоПроблемныхПозиций + 1;
	КонецЦикла;	
	
		СхемаКомпоновкиДанных 	= Документы.РазборКоробки.ПолучитьМакет("СверитьСодержимоеСупергруппы");
		КомпоновщикНастроек		= Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек["Основной"].Настройки);
		
		Настройки 			= КомпоновщикНастроек.Настройки;
		КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
		Настройки, ,,Тип("ГенераторМакетаКомпоновкиДанных"));
		
		
		ВнешниеНаборыДанных = Новый Структура;
		ВнешниеНаборыДанных.Вставить("сверка", 	ТЗ_Сверка);
		
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,);
		
		
		Результат.Очистить(); 
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(Результат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
	Возврат Новый Структура("КоличествоПроблемныхПозиций, Результат", КоличествоПроблемныхПозиций, Результат);
КонецФункции

Функция  	ПолучитьСверкуСупергруппы(Параметры) Экспорт 
	Результат	= Новый ТабличныйДокумент;
	
	ТЗ_Сверка = РасщитатьСверкуСупергруппы(Параметры);
	
	КоличествоПроблемныхПозиций = 0;
	
	Для каждого элем из ТЗ_Сверка Цикл
		Если элем.Разница = 0 Тогда Продолжить; КонецЕсли;
		КоличествоПроблемныхПозиций = КоличествоПроблемныхПозиций + 1;
	КонецЦикла;	
	
		СхемаКомпоновкиДанных 	= Документы.РазборКоробки.ПолучитьМакет("СверитьСодержимоеСупергруппы");
		КомпоновщикНастроек		= Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек["Основной"].Настройки);
		
		Настройки 			= КомпоновщикНастроек.Настройки;
		КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
		Настройки, ,,Тип("ГенераторМакетаКомпоновкиДанных"));
		
		
		ВнешниеНаборыДанных = Новый Структура;
		ВнешниеНаборыДанных.Вставить("сверка", 	ТЗ_Сверка);
		
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,);
		
		
		Результат.Очистить(); 
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(Результат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
	Возврат Новый Структура("КоличествоПроблемныхПозиций, Результат", КоличествоПроблемныхПозиций, Результат);
КонецФункции

Функция 	РасщитатьСверкуСупергруппы(Параметры) 
	
	ТЧ_изДокумента	= ПолучитьТаблицуИзДокумента(Параметры);

	Для каждого элем из Параметры.Документ_Объект.Коробки Цикл
		Если элем.Коробка = Справочники.Коробки.БезКоробки Тогда Продолжить; КонецЕсли;
		строкаТЧ				= ТЧ_изДокумента.Добавить();
		строкаТЧ.НомерСтроки	= элем.НомерСтроки;
		строкаТЧ.Группа			= Параметры.Документ_Объект.Супергруппа;
		строкаТЧ.Заказ			= элем.Коробка;
		строкаТЧ.Выехало		= 0;
		строкаТЧ.Принято		= 1;
	КонецЦикла;
	КоличествоКоробок	= ТЧ_изДокумента.Количество();
	ОдиночныеЗаказы		= Параметры.Документ_Объект.Посылки.Выгрузить(новый Структура("Коробка",Справочники.Коробки.БезКоробки));
	Для каждого элем из ОдиночныеЗаказы Цикл
		строкаТЧ				= ТЧ_изДокумента.Добавить();
		строкаТЧ.НомерСтроки	= элем.НомерСтроки+КоличествоКоробок;
		строкаТЧ.Группа			= Параметры.Документ_Объект.Супергруппа;
		строкаТЧ.Заказ			= элем.Посылка;
		строкаТЧ.Выехало		= 0;
		строкаТЧ.Принято		= 1;
	КонецЦикла;	
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	втВнешняя.НомерСтроки КАК НомерСтроки,
		|	втВнешняя.Заказ 	КАК Заказ,
		|	втВнешняя.Группа 	КАК Группа,
		|	втВнешняя.Участник 	КАК Участник,
		|	втВнешняя.Выехало 	КАК Выехало,
		|	втВнешняя.Принято 	КАК Принято
		|ПОМЕСТИТЬ заказыИзДокумента
		|ИЗ
		|	&втВнешняя КАК втВнешняя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	0 КАК НомерСтроки,
		|	МегаордераСостав.Заказ  	КАК 	Заказ,
		|	&Супергруппа				КАК 	Группа,
		|	МегаордераСостав.Участник 	КАК 	Участник,
		|	1 КАК Выехало,
		|	0 КАК Принято
		|ПОМЕСТИТЬ Сбор
		|ИЗ
		|	Справочник.Мегаордера.Состав КАК МегаордераСостав
		|ГДЕ
		|	МегаордераСостав.Ссылка = &Супергруппа
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	заказыИзДокумента.НомерСтроки,
		|	заказыИзДокумента.Заказ,
		|	заказыИзДокумента.Группа,
		|	заказыИзДокумента.Участник,
		|	заказыИзДокумента.Выехало,
		|	заказыИзДокумента.Принято
		|ИЗ
		|	заказыИзДокумента КАК заказыИзДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(Сбор.НомерСтроки) КАК НомерСтроки,
		|	Сбор.Заказ КАК Заказ,
		|	Сбор.Группа КАК Группа,
		|	МАКСИМУМ(Сбор.Участник) КАК Участник,
		|	СУММА(Сбор.Выехало) КАК Выехало,
		|	СУММА(Сбор.Принято) КАК Принято,
		|	СУММА(Сбор.Принято) - СУММА(Сбор.Выехало)   КАК Разница     
		|ИЗ
		|	Сбор КАК Сбор
		|
		|СГРУППИРОВАТЬ ПО
		|	Сбор.Группа,
		|	Сбор.Заказ";
	
	Запрос.УстановитьПараметр("Супергруппа", 	Параметры.Документ_Объект.Супергруппа);
	Запрос.УстановитьПараметр("втВнешняя", 		ТЧ_изДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции

Функция  	ПолучитьСверкуКоробок(Параметры) Экспорт 
	Результат	= Новый ТабличныйДокумент;
	
	ТЗ_Сверка = РасщитатьСверкуКоробок(Параметры);
	
	КоличествоПроблемныхПозиций = 0;
	
	Для каждого элем из ТЗ_Сверка Цикл
		Если элем.Разница = 0 Тогда Продолжить; КонецЕсли;
		КоличествоПроблемныхПозиций = КоличествоПроблемныхПозиций + 1;
	КонецЦикла;	
	
		СхемаКомпоновкиДанных 	= Документы.РазборКоробки.ПолучитьМакет("СверитьСодержимоеСупергруппы");
		КомпоновщикНастроек		= Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек["Основной"].Настройки);
		
		Настройки 			= КомпоновщикНастроек.Настройки;
		КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
		Настройки, ,,Тип("ГенераторМакетаКомпоновкиДанных"));
		
		
		ВнешниеНаборыДанных = Новый Структура;
		ВнешниеНаборыДанных.Вставить("сверка", 	ТЗ_Сверка);
		
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,);
		
		
		Результат.Очистить(); 
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(Результат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
	Возврат Новый Структура("КоличествоПроблемныхПозиций, Результат", КоличествоПроблемныхПозиций, Результат);
КонецФункции

Функция 	РасщитатьСверкуКоробок(Параметры, ВсеКоробки = ложь) 
	ТЧ_изДокумента	= ПолучитьТаблицуИзДокумента(Параметры);
	
	Если ВсеКоробки Тогда
		ТЧ_Покупки		= Параметры.Документ_Объект.Покупки.Выгрузить(,"НомерСтроки,Покупка,Участник,Количество,Коробка");
		ТЧ_Посылки		= Параметры.Документ_Объект.Посылки.Выгрузить(,"НомерСтроки,Посылка,Коробка");
	Иначе	
		ОтборПоКоробке	= новый структура("Коробка",Параметры.ТекущаяКоробка);
		ТЧ_Покупки		= Параметры.Документ_Объект.Покупки.Выгрузить(ОтборПоКоробке, "НомерСтроки,Покупка,Участник,Количество,Коробка");
		ТЧ_Посылки		= Параметры.Документ_Объект.Посылки.Выгрузить(ОтборПоКоробке, "НомерСтроки,Посылка,Коробка");
	КонецЕсли;
	
	Для каждого элем из ТЧ_Покупки Цикл
		Если элем.Коробка = Справочники.Коробки.БезКоробки Тогда Продолжить; КонецЕсли;
		строкаТЧ				= ТЧ_изДокумента.Добавить();
		строкаТЧ.НомерСтроки	= элем.НомерСтроки;
		строкаТЧ.Группа			= элем.Коробка;
		строкаТЧ.Заказ			= элем.Покупка;
		строкаТЧ.Участник		= элем.Участник;
		строкаТЧ.Выехало		= 0;
		строкаТЧ.Принято		= элем.Количество;
	КонецЦикла;	
	КоличествоЗаказов	= ТЧ_изДокумента.Количество();
	
	Для каждого элем из ТЧ_Посылки Цикл
		Если элем.Коробка = Справочники.Коробки.БезКоробки Тогда Продолжить; КонецЕсли;
		строкаТЧ				= ТЧ_изДокумента.Добавить();
		строкаТЧ.НомерСтроки	= элем.НомерСтроки + КоличествоЗаказов;
		строкаТЧ.Группа			= элем.Коробка;
		строкаТЧ.Заказ			= элем.Посылка;
		строкаТЧ.Участник		= элем.Посылка.Участник;
		строкаТЧ.Выехало		= 0;
		строкаТЧ.Принято		= 1;
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	втВнешняя.НомерСтроки КАК НомерСтроки,
		|	втВнешняя.Заказ КАК Заказ,
		|	втВнешняя.Группа КАК Группа,
		|	втВнешняя.Участник КАК Участник,
		|	втВнешняя.Выехало КАК Выехало,
		|	втВнешняя.Принято КАК Принято
		|ПОМЕСТИТЬ заказыИзДокумента
		|ИЗ
		|	&втВнешняя КАК втВнешняя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	заказыИзДокумента.Группа КАК Группа
		|ПОМЕСТИТЬ КоробкиДокумента
		|ИЗ
		|	заказыИзДокумента КАК заказыИзДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	0 КАК НомерСтроки,
		|	КоробкиСостав.Покупка КАК Заказ,
		|	КоробкиСостав.Ссылка  КАК Группа,
		|	КоробкиСостав.Участник КАК Участник,
		|	1 КАК Выехало,
		|	0 КАК Принято
		|ПОМЕСТИТЬ Сбор
		|ИЗ
		|	Справочник.Коробки.Состав КАК КоробкиСостав
		|ГДЕ
		|	КоробкиСостав.Ссылка В
		|			(ВЫБРАТЬ
		|				КоробкиДокумента.Группа КАК Группа
		|			ИЗ
		|				КоробкиДокумента КАК КоробкиДокумента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	заказыИзДокумента.НомерСтроки,
		|	заказыИзДокумента.Заказ,
		|	заказыИзДокумента.Группа,
		|	заказыИзДокумента.Участник,
		|	заказыИзДокумента.Выехало,
		|	заказыИзДокумента.Принято
		|ИЗ
		|	заказыИзДокумента КАК заказыИзДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(Сбор.НомерСтроки) КАК НомерСтроки,
		|	Сбор.Заказ КАК Заказ,
		|	Сбор.Группа КАК Группа,
		|	МАКСИМУМ(Сбор.Участник) КАК Участник,
		|	СУММА(Сбор.Выехало) КАК Выехало,
		|	СУММА(Сбор.Принято) КАК Принято,
		|	СУММА(Сбор.Принято) - СУММА(Сбор.Выехало)   КАК Разница
		|ИЗ
		|	Сбор КАК Сбор
		|
		|СГРУППИРОВАТЬ ПО
		|	Сбор.Группа,
		|	Сбор.Заказ";
	

	Запрос.УстановитьПараметр("втВнешняя", 		ТЧ_изДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции


Функция		ПолучитьТаблицуИзДокумента(Параметры)
	массивТиповГруппа	= Новый Массив;
	массивТиповГруппа.Добавить(Тип("СправочникСсылка.Мегаордера"));
	массивТиповГруппа.Добавить(Тип("СправочникСсылка.Коробки"));
	
	ТЧ_изДокумента	= Параметры.Документ_Объект.Супергруппа.Состав.ВыгрузитьКолонки();
	ТЧ_изДокумента.Колонки.Добавить("Выехало",	новый ОписаниеТипов("Число"));
	ТЧ_изДокумента.Колонки.Добавить("Принято",	новый ОписаниеТипов("Число"));
	ТЧ_изДокумента.Колонки.Добавить("Группа", 	Новый ОписаниеТипов(массивТиповГруппа));
	
	Возврат ТЧ_изДокумента;
	
КонецФункции



#КонецОбласти


#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
//	СтоСПОбмен_Общий.Получить_ТекстЗапроса_Обмен100сп (Запрос, ТекстыЗапроса, Регистры);
	СтоСПОбмен_Общий.Получить_ТекстЗапроса_Обмен100СП_РН(Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_НеВыгруженноНаСайт(Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_Обмен100СПрн_Ошибки (Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_Транзит(Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_ОстаткиТоваров(Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_ЗаказыВПосылках(Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_Приход(Запрос, ТекстыЗапроса, Регистры);
//	Получить_ТекстЗапроса_КПолучению(Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_Обмен100СП_РН(Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_ШтрафныеЗаказы(Запрос, ТекстыЗапроса, Регистры); 
	
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазборКоробки.ПометкаУдаления КАК ПометкаУдаления,
	|	РазборКоробки.Номер КАК Номер,
	|	РазборКоробки.Дата КАК Период,
	|	РазборКоробки.Проведен КАК Проведен,
	|	РазборКоробки.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.РазборКоробки КАК РазборКоробки
	|ГДЕ
	|	РазборКоробки.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",                        Реквизиты.Период);
	Запрос.УстановитьПараметр("Номер",                         Реквизиты.Номер);
	Запрос.УстановитьПараметр("ИдентификаторМетаданных",       ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПолноеИмяОбъекта()));
	Запрос.УстановитьПараметр("Комментарий",                   Реквизиты.Комментарий);
	Запрос.УстановитьПараметр("ПометкаУдаления",               Реквизиты.ПометкаУдаления);
	Запрос.УстановитьПараметр("Проведен",                      Реквизиты.Проведен);
	Запрос.УстановитьПараметр("гпНеПринимать",                 Константы.гпНеПринимать.Получить()); 
	Запрос.УстановитьПараметр("ВозможностьИспользоватьТранзит",Константы.ВозможностьПриниматьНаТранзит.Получить());
	Запрос.УстановитьПараметр("Курьер100сп",				   Константы.ПунктВыдачиКурьерскойДоставки.Получить());
	Запрос.УстановитьПараметр("ИгнорироватьОшибкуИзмененияПунктаНазначения",				   Константы.ИгнорироватьОшибкуИзмененияПунктаНазначения.Получить());
	
	
КонецПроцедуры

Функция Получить_ТекстЗапроса_НеВыгруженноНаСайт(Запрос, ТекстыЗапроса, Регистры) Экспорт
	ИмяРегистра = "НеВыгруженноНаСайт";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ТипЗнч(Запрос.Параметры.Ссылка)=Тип("ДокументСсылка.РазборКоробки") Тогда
		 ТекстЗапроса = "ВЫБРАТЬ
		 |	РазборКоробкиПосылки.Ссылка.Дата КАК Период,
		 |	РазборКоробкиПосылки.Посылка КАК Посылка,
		 |	РазборКоробкиПосылки.МестоХранения КАК МестоХранения,
		 |	РазборКоробкиПосылки.Габарит КАК Габарит,
		 |	РазборКоробкиПосылки.Коробка КАК Коробка,
		 |	РазборКоробкиПосылки.ПунктВыдачи КАК ПунктВыдачи,
		 |	РазборКоробкиПосылки.Ссылка КАК Партия,
		 |	1 КАК Количество
		 |ИЗ
		 |	Документ.РазборКоробки.Посылки КАК РазборКоробкиПосылки
		 |ГДЕ
		 |	РазборКоробкиПосылки.Ссылка = &Ссылка
		 |	И
		 |	НЕ РазборКоробкиПосылки.Отправлено
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	РазборКоробкиГруппыНаТранзит.Ссылка.Дата,
		 |	NULL,
		 |	РазборКоробкиГруппыНаТранзит.МестоХранения,
		 |	РазборКоробкиГруппыНаТранзит.Габарит,
		 |	РазборКоробкиГруппыНаТранзит.Коробка,
		 |	РазборКоробкиГруппыНаТранзит.ПунктВыдачи,
		 |	РазборКоробкиГруппыНаТранзит.Ссылка,
		 |	1
		 |ИЗ
		 |	Документ.РазборКоробки.ГруппыНаТранзит КАК РазборКоробкиГруппыНаТранзит
         |ГДЕ
         |	РазборКоробкиГруппыНаТранзит.Ссылка = &Ссылка
		 |	И НЕ РазборКоробкиГруппыНаТранзит.Отправлено" ;
	КонецЕсли;	

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

Функция Получить_ТекстЗапроса_Транзит(Запрос, ТекстыЗапроса, Регистры) Экспорт
	ИмяРегистра = "Транзит";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ТипЗнч(Запрос.Параметры.Ссылка)=Тип("ДокументСсылка.РазборКоробки") Тогда
		ТекстЗапроса = "
		|
		|ВЫБРАТЬ
		|	РазборКоробкиПосылки.Ссылка.Дата КАК Период,
		|	РазборКоробкиПосылки.Посылка КАК ПокупкаСсылка,
		|	РазборКоробкиПосылки.МестоХранения КАК МестоХранения,
		|	РазборКоробкиПосылки.Габарит КАК Габарит,
		|	РазборКоробкиПосылки.Посылка.Участник КАК Участник,
		|	Выбор когда РазборКоробкиПосылки.Посылка.ПунктВыдачи = &Курьер100сп Тогда РазборКоробкиПосылки.Посылка.ПунктВыдачи
		|	Иначе РазборКоробкиПосылки.ПунктВыдачи Конец КАК Точка,
		|	РазборКоробкиПосылки.Ссылка КАК Партия,
		|	1 КАК Количество
		|ИЗ
		|	Документ.РазборКоробки.Посылки КАК РазборКоробкиПосылки
		|ГДЕ
		|	РазборКоробкиПосылки.Отправлено
		|	И РазборКоробкиПосылки.Коробка.КРазбору
		|	И РазборКоробкиПосылки.Ссылка = &Ссылка
		|	И не РазборКоробкиПосылки.Ссылка.ДелаемГрупповойСтикер
		|	И (РазборКоробкиПосылки.ПунктВыдачи <> РазборКоробкиПосылки.Ссылка.СвояТочка или
		|	   РазборКоробкиПосылки.Посылка.ПунктВыдачи = &Курьер100сп)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РазборКоробкиПокупки.Ссылка.Дата,
		|	РазборКоробкиПокупки.Покупка,
		|	РазборКоробкиПокупки.МестоХранения,
		|	РазборКоробкиПокупки.Габарит,
		|	РазборКоробкиПокупки.Участник,
		|	РазборКоробкиПокупки.ПунктВыдачи,
		|	РазборКоробкиПокупки.Ссылка,
		|	РазборКоробкиПокупки.Количество
		|ИЗ
		|	Документ.РазборКоробки.Покупки КАК РазборКоробкиПокупки
		|ГДЕ
		|	РазборКоробкиПокупки.Коробка.КРазбору
		|	И РазборКоробкиПокупки.Ссылка = &Ссылка
		|	И не РазборКоробкиПокупки.Ссылка.ДелаемГрупповойСтикер
		|	И РазборКоробкиПокупки.ПунктВыдачи <> РазборКоробкиПокупки.Ссылка.СвояТочка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РазборКоробкиГруппыНаТранзит.Ссылка.Дата,
		|	РазборКоробкиГруппыНаТранзит.Коробка,
		|	РазборКоробкиГруппыНаТранзит.МестоХранения,
		|	РазборКоробкиГруппыНаТранзит.Габарит,
		|	Значение(Справочник.Коробки.БезКоробки),
		|	РазборКоробкиГруппыНаТранзит.ПунктВыдачи,
		|	РазборКоробкиГруппыНаТранзит.Ссылка,
		|	1
		|ИЗ
		|	Документ.РазборКоробки.ГруппыНаТранзит КАК РазборКоробкиГруппыНаТранзит
		|ГДЕ
		|	 РазборКоробкиГруппыНаТранзит.Ссылка = &Ссылка
		|
		|
		|";
	КонецЕсли;	

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

Функция Получить_ТекстЗапроса_ОстаткиТоваров(Запрос, ТекстыЗапроса, Регистры) Экспорт
	ИмяРегистра = "ОстаткиТоваров";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ТипЗнч(Запрос.Параметры.Ссылка)=Тип("ДокументСсылка.РазборКоробки") Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	РазборКоробкиПосылки.Ссылка.Дата КАК Период,
		               |	РазборКоробкиПосылки.Посылка КАК Покупка,
		               |	РазборКоробкиПосылки.МестоХранения КАК МестоХранения,
		               |	РазборКоробкиПосылки.Габарит КАК Габарит,
		               |	РазборКоробкиПосылки.Посылка.Участник КАК Участник,
		               |	ИСТИНА КАК Оплачен,
		               |	ЛОЖЬ КАК Потерян,
		               |	РазборКоробкиПосылки.Ссылка КАК Партия,
		               |	1 КАК Количество
		               |ИЗ
		               |	Документ.РазборКоробки.Посылки КАК РазборКоробкиПосылки
		               |ГДЕ
		               |	РазборКоробкиПосылки.Ссылка = &Ссылка
		               |	и РазборКоробкиПосылки.Посылка.ПунктВыдачи <> &Курьер100сп
		               |	И РазборКоробкиПосылки.Отправлено
		               |	И (НЕ РазборКоробкиПосылки.Коробка.КРазбору
		               |			ИЛИ РазборКоробкиПосылки.Коробка.КРазбору
		               |				И РазборКоробкиПосылки.ПунктВыдачи = РазборКоробкиПосылки.Ссылка.СвояТочка)
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	РазборКоробкиПокупки.Ссылка.Дата,
		               |	РазборКоробкиПокупки.Покупка,
		               |	РазборКоробкиПокупки.МестоХранения,
		               |	РазборКоробкиПокупки.Габарит,
		               |	РазборКоробкиПокупки.Участник,
		               |	РазборКоробкиПокупки.Оплачен,
		               |	ЛОЖЬ,
		               |	РазборКоробкиПокупки.Ссылка,
		               |	РазборКоробкиПокупки.Количество
		               |ИЗ
		               |	Документ.РазборКоробки.Покупки КАК РазборКоробкиПокупки
		               |ГДЕ
		               |	РазборКоробкиПокупки.Ссылка = &Ссылка
		               |	И (НЕ РазборКоробкиПокупки.Коробка.КРазбору
		               |			ИЛИ РазборКоробкиПокупки.Коробка.КРазбору
		               |				И РазборКоробкиПокупки.ПунктВыдачи = РазборКоробкиПокупки.Ссылка.СвояТочка)";
	КонецЕсли;	

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

Функция Получить_ТекстЗапроса_ЗаказыВПосылках(Запрос, ТекстыЗапроса, Регистры) Экспорт
	ИмяРегистра = "ЗаказыВПосылках";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ТипЗнч(Запрос.Параметры.Ссылка)=Тип("ДокументСсылка.РазборКоробки") Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ПосылкиСостав.Ссылка КАК Посылка,
		               |	&Период КАК Период,
		               |	ПосылкиСостав.Покупка КАК Покупка,
		               |	ПосылкиСостав.Участник КАК Участник,
					   |	ПосылкиСостав.КодЗаказа КАК КодЗаказа,
		               |	&Ссылка КАК Партия,
		               |	1 КАК Количество
		               |ИЗ
		               |	Справочник.Посылки.Состав КАК ПосылкиСостав
		               |ГДЕ
		               |	ПосылкиСостав.Ссылка В
		               |			(ВЫБРАТЬ
		               |				РазборКоробкиПосылки.Посылка КАК Посылка
		               |			ИЗ
		               |				Документ.РазборКоробки.Посылки КАК РазборКоробкиПосылки
		               |			ГДЕ
		               |				РазборКоробкиПосылки.Ссылка = &Ссылка
					   |				И РазборКоробкиПосылки.Посылка.ПунктВыдачи.ТранспортнаяКомпания					   
		               |				И РазборКоробкиПосылки.Загружено)";
	КонецЕсли;	

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

Функция Получить_ТекстЗапроса_Обмен100СПрн_Ошибки (Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "Обмен100СПрн_Ошибки";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	//Если Запрос.Параметры.Статус<>Перечисления.СтатусОтпавкиНаСайт.Отправлен Тогда
	//	Возврат "";
	//КонецЕсли; 
	
	ТекстЗапроса =  "
					|
					|ВЫБРАТЬ
	                |	РазборКоробкиПосылки.Ссылка.Дата КАК Период,
	                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	                |	ЗНАЧЕНИЕ(Перечисление.ТипыОбменов100сп.ЗагрузкаПосылок) КАК типОбмена,
	                |	РазборКоробкиПосылки.Ссылка КАК Партия,
	                |	РазборКоробкиПосылки.НомерСтроки КАК СтрокаВПартии,
	                |	РазборКоробкиПосылки.ШК КАК Мегаордер,
	                |	""Не загруженна посылка!"" КАК СообщениеОшибки,
	                |	1 КАК КоличествоНеИсправленных
	                |ИЗ
	                |	Документ.РазборКоробки.Посылки КАК РазборКоробкиПосылки
	                |ГДЕ
	                |	РазборКоробкиПосылки.Ссылка = &Ссылка
	                |	И НЕ РазборКоробкиПосылки.Отправлено
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ
	                |	РазборКоробкиГруппыНаТранзит.Ссылка.Дата КАК Период,
	                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	                |	ЗНАЧЕНИЕ(Перечисление.ТипыОбменов100сп.Приход) КАК типОбмена,
	                |	РазборКоробкиГруппыНаТранзит.Ссылка КАК Партия,
	                |	РазборКоробкиГруппыНаТранзит.НомерСтроки КАК СтрокаВПартии,
	                |	РазборКоробкиГруппыНаТранзит.ШК КАК Мегаордер,
	                |	""Не выполнен обмен!"" КАК СообщениеОшибки,
	                |	1 КАК КоличествоНеИсправленных
	                |ИЗ
	                |	Документ.РазборКоробки.ГруппыНаТранзит КАК РазборКоробкиГруппыНаТранзит
	                |ГДЕ
	                |	РазборКоробкиГруппыНаТранзит.Ссылка = &Ссылка
	                |	И НЕ РазборКоробкиГруппыНаТранзит.Отправлено
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	РазборКоробкиПосылки.Ссылка.Дата,
	                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	                |	ЗНАЧЕНИЕ(Перечисление.ТипыОбменов100сп.ЗагрузкаПосылок),
	                |	РазборКоробкиПосылки.Ссылка,
	                |	РазборКоробкиПосылки.НомерСтроки,
	                |	РазборКоробкиПосылки.ШК,
	                |	""Не загружен состав посылки (для Объединенной доставки)!"",
	                |	1
	                |ИЗ
	                |	Документ.РазборКоробки.Посылки КАК РазборКоробкиПосылки
	                |ГДЕ
	                |	РазборКоробкиПосылки.Ссылка = &Ссылка
	                |	И РазборКоробкиПосылки.Посылка.ПунктВыдачи.ТранспортнаяКомпания
	                |	И НЕ РазборКоробкиПосылки.Загружено
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	РазборКоробкиПосылки.Ссылка.Дата,
	                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	                |	ЗНАЧЕНИЕ(Перечисление.ТипыОбменов100сп.ЗагрузкаПосылок),
	                |	РазборКоробкиПосылки.Ссылка,
	                |	РазборКоробкиПосылки.НомерСтроки,
	                |	РазборКоробкиПосылки.ШК,
	                |	""Изменился пункт назначения посылки!"",
	                |	1
	                |ИЗ
	                |	Документ.РазборКоробки.Посылки КАК РазборКоробкиПосылки
	                |ГДЕ
	                |	РазборКоробкиПосылки.Ссылка = &Ссылка
	                |	И РазборКоробкиПосылки.Отправлено
	                |	И РазборКоробкиПосылки.Посылка.ПунктВыдачи <> РазборКоробкиПосылки.ПунктВыдачи
	                |	и (не &ИгнорироватьОшибкуИзмененияПунктаНазначения
	                |	или РазборКоробкиПосылки.Посылка.ПунктВыдачи.ТранспортнаяКомпания
	                |	или РазборКоробкиПосылки.ПунктВыдачи.ТранспортнаяКомпания
	                |	
	                |)
					|
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	РазборКоробкиПосылки.Ссылка.Дата,
	                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	                |	ЗНАЧЕНИЕ(Перечисление.ТипыОбменов100сп.ЗагрузкаПосылок),
	                |	РазборКоробкиПосылки.Ссылка,
	                |	РазборКоробкиПосылки.НомерСтроки,
	                |	РазборКоробкиПосылки.ШК,
	                |	""Участник из не приемной группы!"",
	                |	1
	                |ИЗ
	                |	Документ.РазборКоробки.Посылки КАК РазборКоробкиПосылки
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиВГруппах КАК УчастникиВГруппах
	                |		ПО РазборКоробкиПосылки.Посылка.Участник = УчастникиВГруппах.Участник
	                |			И (УчастникиВГруппах.Группа = &гпНеПринимать)
	                |ГДЕ
	                |	РазборКоробкиПосылки.Ссылка = &Ссылка
	                |	И РазборКоробкиПосылки.Отправлено
					|	И РазборКоробкиПосылки.ПунктВыдачи = РазборКоробкиПосылки.Ссылка.СвояТочка
					|
					|";
	
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
КонецФункции

Функция Получить_ТекстЗапроса_Приход(Запрос, ТекстыЗапроса, Регистры) Экспорт
	ИмяРегистра = "Приход";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ТипЗнч(Запрос.Параметры.Ссылка)=Тип("ДокументСсылка.РазборКоробки") Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	РазборКоробкиПосылки.Ссылка.Дата 			КАК Период,
		               |	РазборКоробкиПосылки.Габарит 				КАК Габарит,
		               |	РазборКоробкиПосылки.МестоХранения 			КАК МестоХранения,
		               |	РазборКоробкиПосылки.Посылка.Организатор 	КАК Организатор,
		               |	РазборКоробкиПосылки.Посылка 				КАК Покупка,
		               |	1 											КАК Количество,
		               |	РазборКоробкиПосылки.Коробка 				КАК Коробка,
		               |	ВЫБОР
		               |		Когда 		РазборКоробкиПосылки.Посылка.ПунктВыдачи = &Курьер100сп Тогда
		               |				ЗНАЧЕНИЕ(Перечисление.ТипыПриходов.НаТранзит)
		               |		КОГДА 		НЕ 	РазборКоробкиПосылки.Коробка.КРазбору
		               |					ИЛИ 
		               |						РазборКоробкиПосылки.Коробка.КРазбору
		               |					И 	РазборКоробкиПосылки.ПунктВыдачи = РазборКоробкиПосылки.Ссылка.СвояТочка
		               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПриходов.НаСклад)
		               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПриходов.НаТранзит)
		               |	КОНЕЦ 										КАК ТипПрихода,
		               |	РазборКоробкиПосылки.ОтдельнымМестом КАК ОтдельнымМестом,
		               |	РазборКоробкиПосылки.Посылка.Участник 		КАК Участник
		               |ИЗ
		               |	Документ.РазборКоробки.Посылки КАК РазборКоробкиПосылки
		               |ГДЕ
	//	               |	РазборКоробкиПосылки.Отправлено И
		               |	 РазборКоробкиПосылки.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	РазборКоробкиГруппыНаТранзит.Ссылка.Дата 			КАК Период,
		               |	РазборКоробкиГруппыНаТранзит.Габарит 				КАК Габарит,
		               |	РазборКоробкиГруппыНаТранзит.МестоХранения 			КАК МестоХранения,
		               |	РазборКоробкиГруппыНаТранзит.Коробка.Организатор 	КАК Организатор,
		               |	РазборКоробкиГруппыНаТранзит.Коробка 				КАК Покупка,
		               |	1 													КАК Количество,
		               |	ЗНАЧЕНИЕ(Справочник.Коробки.БезКоробки)				КАК Коробка,
		               |	ЗНАЧЕНИЕ(Перечисление.ТипыПриходов.НаТранзит)		КАК ТипПрихода,
		               |	Ложь,
		               |	Неопределено						 				КАК Участник
		               |ИЗ
		               |	Документ.РазборКоробки.ГруппыНаТранзит КАК РазборКоробкиГруппыНаТранзит
		               |ГДЕ
	//	               |	РазборКоробкиПосылки.Отправлено И
		               |	 РазборКоробкиГруппыНаТранзит.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	РазборКоробкиПокупки.Ссылка.Дата,
		               |	РазборКоробкиПокупки.Габарит,
		               |	РазборКоробкиПокупки.МестоХранения 			КАК МестоХранения,
		               |	ВЫБОР
		               |		КОГДА ТИПЗНАЧЕНИЯ(РазборКоробкиПокупки.Покупка) = ТИП(Справочник.Покупки)
		               |			ТОГДА РазборКоробкиПокупки.Покупка.Владелец
		               |		ИНАЧЕ РазборКоробкиПокупки.Покупка.Организатор
		               |	КОНЕЦ,
		               |	РазборКоробкиПокупки.Покупка,
		               |	РазборКоробкиПокупки.Количество,
		               |	РазборКоробкиПокупки.Коробка,
		               |	ВЫБОР
		               |		КОГДА НЕ РазборКоробкиПокупки.Коробка.КРазбору
		               |				ИЛИ не &ВозможностьИспользоватьТранзит
		               |				ИЛИ РазборКоробкиПокупки.Коробка.КРазбору
		               |					И РазборКоробкиПокупки.ПунктВыдачи = РазборКоробкиПокупки.Ссылка.СвояТочка
		               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПриходов.НаСклад)
		               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПриходов.НаТранзит)
		               |	КОНЕЦ,
		               |	РазборКоробкиПокупки.ОтдельнымМестом КАК ОтдельнымМестом,
		               |	РазборКоробкиПокупки.Участник
		               |ИЗ
		               |	Документ.РазборКоробки.Покупки КАК РазборКоробкиПокупки
		               |ГДЕ
		               |	РазборКоробкиПокупки.Ссылка = &Ссылка
		               |	И НЕ РазборКоробкиПокупки.Ссылка.ДелаемГрупповойСтикер";
	КонецЕсли;	

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

Функция Получить_ТекстЗапроса_КПолучению(Запрос, ТекстыЗапроса, Регистры) Экспорт
	ИмяРегистра = "КПолучению";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ТипЗнч(Запрос.Параметры.Ссылка)=Тип("ДокументСсылка.РазборКоробки") Тогда
		   
		ТекстЗапроса = "
					   |
					   |ВЫБРАТЬ
		               |	&Период КАК Период,
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		               |	КПолучениюОстатки.КоличествоОстаток КАК Количество,
		               |	КПолучениюОстатки.ДокументВыдачи КАК ДокументВыдачи,
		               |	КПолучениюОстатки.Покупка КАК Покупка,
		               |	КПолучениюОстатки.Участник КАК Участник
		               |ИЗ
		               |	РегистрНакопления.КПолучению.Остатки(
		               |			ДОБАВИТЬКДАТЕ(&Период, СЕКУНДА, -1),
		               |			(Участник, Покупка) В
		               |				(ВЫБРАТЬ
		               |					РазборКоробкиПокупки.Участник КАК Участник,
		               |					РазборКоробкиПокупки.Покупка КАК Покупка
		               |				ИЗ
		               |					Документ.РазборКоробки.Покупки КАК РазборКоробкиПокупки
		               |				ГДЕ
		               |					РазборКоробкиПокупки.Ссылка = &Ссылка
		               |			
		               |				ОБЪЕДИНИТЬ ВСЕ
		               |			
		               |				ВЫБРАТЬ
		               |					ЗНАЧЕНИЕ(Справочник.Участники.Нулевой),
		               |					РазборКоробкиКоробки.Коробка
		               |				ИЗ
		               |					Документ.РазборКоробки.Коробки КАК РазборКоробкиКоробки
		               |				ГДЕ
		               |					РазборКоробкиКоробки.Ссылка = &Ссылка
		               |			
		               |				ОБЪЕДИНИТЬ ВСЕ
		               |			
		               |				ВЫБРАТЬ
		               |					РазборКоробкиПосылки.Посылка.Участник,
		               |					РазборКоробкиПосылки.Посылка
		               |				ИЗ
		               |					Документ.РазборКоробки.Посылки КАК РазборКоробкиПосылки
		               |				ГДЕ
		               |					РазборКоробкиПосылки.Ссылка = &Ссылка)) КАК КПолучениюОстатки
		               |ГДЕ
		               |	КПолучениюОстатки.КоличествоОстаток > 0
					   |
					   |";
	КонецЕсли;	

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

Функция Получить_ТекстЗапроса_Обмен100СП_РН(Запрос, ТекстыЗапроса, Регистры) Экспорт
	ИмяРегистра = "Обмен100СПрн";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ТипЗнч(Запрос.Параметры.Ссылка)=Тип("ДокументСсылка.РазборКоробки") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	РазборКоробки.Ссылка.Дата КАК Период,
		               |	1 КАК КоличествоНеОтправленых,
		               |	РазборКоробки.Ссылка КАК Партия,
		               |	ЗНАЧЕНИЕ(Перечисление.ТипыОбменов100сп.СуперГруппаРегистрация) КАК ТипОбмена
		               |ИЗ
		               |	Документ.РазборКоробки КАК РазборКоробки
		               |ГДЕ
		               |	РазборКоробки.Ссылка = &Ссылка
		               |	И РазборКоробки.Супергруппа <> ЗНАЧЕНИЕ(Справочник.Мегаордера.ПустаяСсылка)
		               |
		               |";
	КонецЕсли;
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции


Функция Получить_ТекстЗапроса_ШтрафныеЗаказы(Запрос, ТекстыЗапроса, Регистры) Экспорт
	ИмяРегистра = "ШтрафныеЗаказы";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ТипЗнч(Запрос.Параметры.Ссылка)=Тип("ДокументСсылка.РазборКоробки") Тогда
		
		ТекстЗапроса = 
		
		
		
		
		"ВЫБРАТЬ
		|	вт.Период КАК период,
		|	вт.Коробка,
		|	вт.Организатор,
		|	вт.ПунктВыдачи,
		|	вт.Количество как Разобрано,
		|	ВЫБОР
		|		КОГДА вт.коробка = ЗНАЧЕНИЕ(Справочник.Коробки.БезКоробки)
		|			ТОГДА вт.Количество
		|		КОГДА вт.Количество > 2
		|			ТОГДА вт.Количество - 2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Штраф,
		|	0 КАК ГруппыНаТранзит,
		|	0 КАК Одиночные
		|ИЗ
		|	(ВЫБРАТЬ
		|		РазборКоробкиПосылки.Ссылка.Дата КАК Период,
		|		РазборКоробкиПосылки.Коробка,
		|		РазборКоробкиПосылки.Посылка.Организатор КАК Организатор,
		|		РазборКоробкиПосылки.ПунктВыдачи,
		|		СУММА(1) КАК Количество
		|	ИЗ
		|		Документ.РазборКоробки.Посылки КАК РазборКоробкиПосылки
		|	ГДЕ
		|		РазборКоробкиПосылки.Ссылка = &Ссылка
		|		И РазборКоробкиПосылки.Коробка <> ЗНАЧЕНИЕ(Справочник.Коробки.БезКоробки)
		|	СГРУППИРОВАТЬ ПО
		|		РазборКоробкиПосылки.Ссылка.Дата,
		|		РазборКоробкиПосылки.Коробка,
		|		РазборКоробкиПосылки.Посылка.Организатор,
		|		РазборКоробкиПосылки.ПунктВыдачи) КАК вт
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РазборКоробкиГруппыНаТранзит.Ссылка.Дата КАК Период,
		|	РазборКоробкиГруппыНаТранзит.Коробка,
		|	РазборКоробкиГруппыНаТранзит.Коробка.Организатор,
		|	РазборКоробкиГруппыНаТранзит.ПунктВыдачи,
		|	0,
		|	0,
		|	РазборКоробкиГруппыНаТранзит.Коробка.Количество,
		|	0
		|ИЗ
		|	Документ.РазборКоробки.ГруппыНаТранзит КАК РазборКоробкиГруппыНаТранзит
		|ГДЕ
		|	РазборКоробкиГруппыНаТранзит.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РазборКоробкиПосылки.Ссылка.Дата КАК Период,
		|	РазборКоробкиПосылки.Коробка,
		|	РазборКоробкиПосылки.Посылка.Организатор КАК Организатор,
		|	РазборКоробкиПосылки.ПунктВыдачи,
		|	0,
		|	0,
		|	0,
		|	СУММА(1)
		|ИЗ
		|	Документ.РазборКоробки.Посылки КАК РазборКоробкиПосылки
		|ГДЕ
		|	РазборКоробкиПосылки.Ссылка = &Ссылка
		|	И РазборКоробкиПосылки.Коробка = ЗНАЧЕНИЕ(Справочник.Коробки.БезКоробки)
		|СГРУППИРОВАТЬ ПО
		|	РазборКоробкиПосылки.Ссылка.Дата,
		|	РазборКоробкиПосылки.Коробка,
		|	РазборКоробкиПосылки.Посылка.Организатор,
		|	РазборКоробкиПосылки.ПунктВыдачи";
	КонецЕсли;
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции




#КонецОбласти

#Область Обмен100сп
Функция ПолучитьТэг_Income(Ссылка,НомерСтроки=Неопределено) Экспорт
	ОтборПоСсылке=?(ТипЗнч(Ссылка)=Тип("Массив")," В (&Ссылка) "," = &Ссылка ");
	ОтборПоСтроке=?(ТипЗнч(Ссылка)=Тип("Массив")," В (&НомерСтроки) "," = &НомерСтроки ");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазборКоробкиПокупки.Оплачен КАК Оплачен,
		|	РазборКоробкиПокупки.ДатаПриема КАК ДатаПриема,
		|	РазборКоробкиПокупки.МестоХранения КАК МестоХранения,
		|	РазборКоробкиПокупки.Габарит КАК Габарит,
		|	РазборКоробкиПокупки.Коробка КАК Коробка,
		|	РазборКоробкиПокупки.Ссылка.СвояТочка КАК СвояТочка,
		|	РазборКоробкиПокупки.ПунктВыдачи КАК ПунктВыдачи,
		|	РазборКоробкиПокупки.Ссылка.Дата КАК Дата,
		|	РазборКоробкиПокупки.ШК КАК ШК,
		|	РазборКоробкиПокупки.ОтдельнымМестом КАК ОтдельнымМестом,
		|	РазборКоробкиПокупки.Ссылка.Номер КАК Номер
		|ИЗ
		|	Документ.РазборКоробки.Покупки КАК РазборКоробкиПокупки
		|ГДЕ
		|	РазборКоробкиПокупки.Ссылка "+ОтборПоСсылке+" "+?(НомерСтроки=Неопределено,"", "
		|	И РазборКоробкиПокупки.НомерСтроки "+ОтборПоСтроке+" ");
	
	Запрос.УстановитьПараметр("НомерСтроки", НомерСтроки);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда Возврат ""; КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ЗаписьXML=новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Служебный");
	Пока Выборка.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("income");
		СтоСП.Вставить_Тэг(ЗаписьXML,"paid"	,				?(Выборка.Оплачен,1,0));
		СтоСП.Вставить_Тэг(ЗаписьXML,"date"	,				?(ЗначениеЗаполнено(Выборка.ДатаПриема),Выборка.ДатаПриема,Выборка.Дата));
		СтоСП.Вставить_Тэг(ЗаписьXML,"uid"	, 				Формат(Число(Выборка.ШК.Участник.Код),"ЧГ=0"));
		СтоСП.Вставить_Тэг(ЗаписьXML,"orgid", 				Формат(Число(Выборка.ШК.Организатор.Код),"ЧГ=0"));
		СтоСП.Вставить_Тэг(ЗаписьXML,"sizedCategoryName",   Выборка.МестоХранения.Наименование);
		СтоСП.Вставить_Тэг(ЗаписьXML,"arrivalNumber",       Прав(Выборка.Номер,(СтрДлина(Выборка.Номер)-3)));
		СтоСП.Вставить_Тэг(ЗаписьXML,"sizedCategoryNumber", СтоСП.ПолучитьПредставлениеГабарита(Выборка.Габарит));
		СтоСП.Вставить_Тэг(ЗаписьXML,"transit",             ?((Выборка.Коробка.КРазбору И Выборка.СвояТочка <> Выборка.ПунктВыдачи),1,0));
		
		Если Выборка.Коробка <> Справочники.Коробки.БезКоробки Тогда
			СтоСП.Вставить_Тэг(ЗаписьXML,"groupCode", Формат(Число(Выборка.Коробка.Код),"ЧГ=0"));
		КонецЕсли;

		СтоСП.Вставить_Тэг(ЗаписьXML,"isBig",               ?(Выборка.Габарит.НеГабарит,1,0));
		СтоСП.Вставить_Тэг(ЗаписьXML,"isFree",              ?(Выборка.ОтдельнымМестом,1,0));
		СтоСП.Вставить_Тэг(ЗаписьXML,"DistributorFee",      0);                                  //Орг сбор
		СтоСПОбмен_Общий.ЗаполнитьТэгиЗаказаПо_ШК(Выборка.ШК,ЗаписьXML);		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	рез=ЗаписьXML.Закрыть();
	рез=СтрЗаменить(рез,"<Служебный>","");
	рез=СтрЗаменить(рез,"</Служебный>","");
	
	Возврат рез;
КонецФункции

Функция ПолучитьТэг_Income_Посылки(Ссылка,НомерСтроки=Неопределено) Экспорт
	ОтборПоСсылке=?(ТипЗнч(Ссылка)=Тип("Массив")," В (&Ссылка) "," = &Ссылка ");
	ОтборПоСтроке=?(ТипЗнч(Ссылка)=Тип("Массив")," В (&НомерСтроки) "," = &НомерСтроки ");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазборКоробкиПосылки.Посылка 			КАК Заказ,
		|	РазборКоробкиПосылки.ПунктВыдачи 		КАК ПунктВыдачи,		
		|	РазборКоробкиПосылки.МестоХранения 		КАК МестоХранения,
		|	РазборКоробкиПосылки.Габарит 			КАК Габарит,
		|	РазборКоробкиПосылки.ДатаПриема 		КАК ДатаПриема,
		|	РазборКоробкиПосылки.Коробка 			КАК Коробка,
		|	РазборКоробкиПосылки.Ссылка.СвояТочка 	КАК СвояТочка,
		|	РазборКоробкиПосылки.Ссылка.Дата 		КАК Дата,
		|	РазборКоробкиПосылки.ОтдельнымМестом 	КАК ОтдельнымМестом,
		|	РазборКоробкиПосылки.ШК			 		КАК ШК,
		|	РазборКоробкиПосылки.Ссылка.Номер 		КАК Номер
		|ИЗ
		|	Документ.РазборКоробки.Посылки КАК РазборКоробкиПосылки
		|ГДЕ
		|	РазборКоробкиПосылки.Ссылка "+ОтборПоСсылке+" "+?(НомерСтроки=Неопределено,"", "
		|	И РазборКоробкиПосылки.НомерСтроки "+ОтборПоСтроке+" ") + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РазборКоробкиГруппыНаТранзит.Коробка 			КАК Заказ,
		|	РазборКоробкиГруппыНаТранзит.ПунктВыдачи 		КАК ПунктВыдачи,		
		|	РазборКоробкиГруппыНаТранзит.МестоХранения 		КАК МестоХранения,
		|	РазборКоробкиГруппыНаТранзит.Габарит 			КАК Габарит,
		|	РазборКоробкиГруппыНаТранзит.ДатаПриема 		КАК ДатаПриема,
		|	Значение(Справочник.Коробки.ПустаяСсылка) 		КАК Коробка,
		|	РазборКоробкиГруппыНаТранзит.Ссылка.СвояТочка 	КАК СвояТочка,
		|	РазборКоробкиГруппыНаТранзит.Ссылка.Дата 		КАК Дата,
		|	РазборКоробкиГруппыНаТранзит.ОтдельнымМестом 	КАК ОтдельнымМестом,
		|	РазборКоробкиГруппыНаТранзит.ШК			 		КАК ШК,		
		|	РазборКоробкиГруппыНаТранзит.Ссылка.Номер 		КАК Номер
		|ИЗ
		|	Документ.РазборКоробки.ГруппыНаТранзит КАК РазборКоробкиГруппыНаТранзит
		|ГДЕ
		|	РазборКоробкиГруппыНаТранзит.Ссылка "+ОтборПоСсылке+" "+?(НомерСтроки=Неопределено,"", "
		|	И РазборКоробкиГруппыНаТранзит.НомерСтроки "+ОтборПоСтроке+" ")
	
	
	;
	
	Запрос.УстановитьПараметр("НомерСтроки", НомерСтроки);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда Возврат ""; КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();

	ЗаписьXML = новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьНачалоЭлемента("Служебный");
	Пока Выборка.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("income");
		СтоСП.Вставить_Тэг(ЗаписьXML, "paid", 1);
		СтоСП.Вставить_Тэг(ЗаписьXML, "date", ?(ЗначениеЗаполнено(Выборка.ДатаПриема), Выборка.ДатаПриема, Выборка.Дата));
		СтоСП.Вставить_Тэг(ЗаписьXML, "sizedCategoryName", Выборка.МестоХранения.Наименование);
		СтоСП.Вставить_Тэг(ЗаписьXML, "arrivalNumber", Прав(Выборка.Номер, (СтрДлина(Выборка.Номер)
			- 3)));
		СтоСП.Вставить_Тэг(ЗаписьXML, "sizedCategoryNumber", СтоСП.ПолучитьПредставлениеГабарита(Выборка.Габарит));
		СтоСП.Вставить_Тэг(ЗаписьXML, "transit", ?((Выборка.Коробка.КРазбору
			И Выборка.СвояТочка <> Выборка.ПунктВыдачи) или ТипЗнч(Выборка.Заказ) = Тип("СправочникСсылка.Коробки"), 1, 0));



		СтоСП.Вставить_Тэг(ЗаписьXML, 						"isBig", ?(Выборка.Габарит.НеГабарит, 1, 0));
		СтоСП.Вставить_Тэг(ЗаписьXML, 						"isFree", ?(Выборка.ОтдельнымМестом, 1, 0));
		СтоСП.Вставить_Тэг(ЗаписьXML, 						"DistributorFee", 0); //Орг сбор
		Если ТипЗнч(Выборка.Заказ) = Тип("СправочникСсылка.Посылки") Тогда
			Если Выборка.Коробка <> Справочники.Коробки.БезКоробки Тогда
				СтоСП.Вставить_Тэг(ЗаписьXML, "groupCode", 	Формат(Число(Выборка.Коробка.Код), "ЧГ=0"));
			КонецЕсли;
			СтоСП.Вставить_Тэг(ЗаписьXML, "packageId", 		Формат(Выборка.Заказ.Код, "ЧГ=0"));
			СтоСП.Вставить_Тэг(ЗаписьXML, "orderType", 		"package");
		Иначе
			СтоСП.Вставить_Тэг(ЗаписьXML, "orgid", 	   		Формат(Число(Выборка.ШК.Организатор.Код),"ЧГ=0"));
			СтоСП.Вставить_Тэг(ЗаписьXML, "groupCode", 		Формат(Выборка.Заказ.Код, "ЧГ=0"));
			СтоСП.Вставить_Тэг(ЗаписьXML, "orderType", 		"group");
		КонецЕсли;

		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	рез = ЗаписьXML.Закрыть();
	рез=СтрЗаменить(рез,"<Служебный>","");
	рез=СтрЗаменить(рез,"</Служебный>","");
	
	Возврат рез;
КонецФункции


Функция ПолучитьТэг_superGroupReceipt(Ссылка,НомерСтроки=Неопределено) Экспорт
	ОтборПоСсылке=?(ТипЗнч(Ссылка)=Тип("Массив")," В (&Ссылка) "," = &Ссылка ");
	ОтборПоСтроке=?(ТипЗнч(Ссылка)=Тип("Массив")," В (&НомерСтроки) "," = &НомерСтроки ");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазборКоробки.Ссылка.Дата КАК Дата,
		|	1 КаК НомерСтроки,
		|	РазборКоробки.СуперГруппа КАК СупперГруппа
		|ИЗ
		|	Документ.РазборКоробки КАК РазборКоробки 
		|ГДЕ
		|	РазборКоробки.СуперГруппа<> Значение(Справочник.Мегаордера.ПустаяСсылка)	
		|	и РазборКоробки.Ссылка "+ОтборПоСсылке+" ";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСупергруппа = РезультатЗапроса.Выбрать();
	
	ЗаписьXML=новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Служебный");	
	
	Пока ВыборкаСупергруппа.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("superGroupReceipt");
		СтоСП.Вставить_Тэг(ЗаписьXML,"documentNumber",		ВыборкаСупергруппа.СупперГруппа);
		СтоСП.Вставить_Тэг(ЗаписьXML,"actualDeliveryDate",	ВыборкаСупергруппа.Дата);
		
		ЗаписьXML.ЗаписатьКонецЭлемента();    //superGroupReceipt
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();    //Служебный
	рез=ЗаписьXML.Закрыть();
	рез=СтрЗаменить(рез,"<Служебный>","");
	рез=СтрЗаменить(рез,"</Служебный>","");
	Возврат рез;
	
	
КонецФункции


#КонецОбласти




Функция ПолноеИмяОбъекта()
	Возврат "Документ.РазборКоробки";
КонецФункции
